In [157]:
import pandas as pd

In [158]:
data = pd.read_csv('melb_data.csv')
data

,Unnamed: 0,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
1,2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
2,4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
3,5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0
4,6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18391,23540,Williamstown,8/2 Thompson St,2,t,622500.0,SP,Greg,26/08/2017,6.8,...,2.0,1.0,NaN,89.0,2010.0,NaN,-37.86393,144.90484,Western Metropolitan,6380.0
18392,23541,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
18393,23544,Yallambie,17 Amaroo Wy,4,h,1100000.0,S,Buckingham,26/08/2017,12.7,...,3.0,2.0,NaN,NaN,NaN,NaN,-37.72006,145.10547,Northern Metropolitan,1369.0
18394,23545,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0
18395,23546,Yarraville,33 Freeman St,4,h,1050000.0,VB,Village,26/08/2017,6.3,...,2.0,2.0,NaN,139.0,1950.0,NaN,-37.81829,144.87404,Western Metropolitan,6543.0

In [159]:
animals = ['tiger', 'moose', 'lion']
p_animals = pd.Series(animals)
p_animals

0    tiger
1    moose
2     lion
dtype: object

In [160]:
type(p_animals)

pandas.core.series.Series

In [161]:
p_animals[1]

'moose'

In [162]:
animals = ['tiger', 'moose', None]
p_animals = pd.Series(animals)
p_animals

0    tiger
1    moose
2     None
dtype: object

In [163]:
number = [1.0 , 20 , 1.5]
p_number = pd.Series(number)
p_number

0     1.0
1    20.0
2     1.5
dtype: float64

In [164]:
number = [1.0 , 20.1 , None ]
p_number = pd.Series(number)
p_number

0     1.0
1    20.1
2     NaN
dtype: float64

In [165]:
dictionary = {
    '1' : 'lion',
    '2' : 'monky',
    '3' : 'donky'
}
p_dictionary = pd.Series(dictionary)
p_dictionary

1     lion
2    monky
3    donky
dtype: object

In [166]:
print(p_dictionary.iloc[2])

donky

In [167]:
p_dictionary.values

array(['lion', 'monky', 'donky'], dtype=object)

In [168]:
p_dictionary.index

Index(['1', '2', '3'], dtype='object')

In [169]:
p_dictionary = pd.Series(['saipa' , 'pride' , 'smannd'] , index=['1' , '2' , '3'])
p_dictionary

1     saipa
2     pride
3    smannd
dtype: object

In [170]:
p_dictionary['2']

'pride'

In [171]:
p_dictionary.iloc[2]

'smannd'

In [172]:
p_dictionary.loc['2']

'pride'

In [173]:
dictionary = {
    'n1' : 'lion',
    'n2' : 'monky',
    'n3' : 'donky'
}
p_dictionary = pd.Series(dictionary)
dictionary = {
    'n1' : 'lion2',
    'n2' : 'monky2',
    'n3' : 'donky2'
}
p_dictionary2 = pd.Series(dictionary)
dictionary = {
    'n1' : 'lion3',
    'n2' : 'monky3',
    'n3' : 'donky3'
}
p_dictionary3 = pd.Series(dictionary)
df = pd.DataFrame([p_dictionary,p_dictionary2,p_dictionary3],index=['r1','r2','r3'])
df

       n1      n2      n3
r1   lion   monky   donky
r2  lion2  monky2  donky2
r3  lion3  monky3  donky3

In [174]:
df.loc['r1']

n1     lion
n2    monky
n3    donky
Name: r1, dtype: object

In [175]:
df.loc['r2'].loc['n2']

'monky2'

In [176]:
df.loc['r3','n3']

'donky3'

In [177]:
df.T

       r1      r2      r3
n1   lion   lion2   lion3
n2  monky  monky2  monky3
n3  donky  donky2  donky3

In [178]:
df['n2']

r1     monky
r2    monky2
r3    monky3
Name: n2, dtype: object

In [179]:
df[['n2']]

        n2
r1   monky
r2  monky2
r3  monky3

In [180]:
df.loc[:,['n2','n3']]

        n2      n3
r1   monky   donky
r2  monky2  donky2
r3  monky3  donky3

In [181]:
df2=df.copy()

In [182]:
df2.drop('r1',inplace=True)
df2

       n1      n2      n3
r2  lion2  monky2  donky2
r3  lion3  monky3  donky3

In [183]:
df2.drop('r2',inplace=True)
df2

       n1      n2      n3
r3  lion3  monky3  donky3

In [184]:
df

       n1      n2      n3
r1   lion   monky   donky
r2  lion2  monky2  donky2
r3  lion3  monky3  donky3

In [185]:
df2

       n1      n2      n3
r3  lion3  monky3  donky3

In [186]:
df3 = df[:]
df3

       n1      n2      n3
r1   lion   monky   donky
r2  lion2  monky2  donky2
r3  lion3  monky3  donky3

In [187]:
df3.drop('r1',inplace=True)
df3

C:\Users\iliya_pc\AppData\Local\Temp\ipykernel_14636\4656604.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop('r1',inplace=True)

       n1      n2      n3
r2  lion2  monky2  donky2
r3  lion3  monky3  donky3

In [188]:
df['n2'] = 1
df

       n1  n2      n3
r1   lion   1   donky
r2  lion2   1  donky2
r3  lion3   1  donky3

In [189]:
df['n2'] = df['n2'] * 2
df

       n1  n2      n3
r1   lion   2   donky
r2  lion2   2  donky2
r3  lion3   2  donky3

In [190]:
n3 = df['n3']

In [192]:
n3 += '!'
n3

r1     donky!
r2    donky2!
r3    donky3!
Name: n3, dtype: object

In [193]:
df

       n1  n2       n3
r1   lion   2   donky!
r2  lion2   2  donky2!
r3  lion3   2  donky3!